In [1]:
# 04_DAwPYT_BL_04

Regex, data analizde olmazsa olmaz enstrümanlardan birisidir.
Bazen datalar çok karmaşık gelebilir.
Regular expression ile işimize yarayan datayı ordan tutup çekmemize yarıyor.

Özellikle twitter facebook gibi sosyal medya platformlarında yazım kurallarının dışına sıklıkla çıkılıyor.
Kelimelerle iç içe şekilde sayılar, emojiler, farklı dillerde ifadeler kullanılabiliyor.
Bu durumlarda kelimeleri temiz şekilde ayıklama ihtiyacı duyuluyor.

Mesela;
A12B
C34G
H78J 

gibi bir datada benim sadece ortadaki sayılara ihtiyacım var ve onları aradan almam gerekiyor.
bunu biz regular expression ile yapıyoruz. 

regular.com sitesinde: 
kod bölümüne \d koyduğumuzda datada bir digit gördüğünde onu seçer.
eğer \d\d bu şekilde 2 yanyana \d koyarsak yan yana iki numerik değer olan yerleri seçer.

In [2]:
# regex101.com adresinden metinin içinden veri çekme testini yapabilirsin
import re      # regular expression kütüphanesi
import pandas as pd

 Expressions :

"\d"   Any numeric digit from `0` to `9`.
"\D"   Matches any character which is not a decimal digit. This is the opposite of `\d`.
"\"     Any letter, numeric digit, or the underscore character.  (Think of this as matching "word" characters.)
"\W"   Any character that is not a letter, numeric digit, or the underscore character.
"\s"   Any space, tab, or newline character.(Think of this as matching white-space characters.)
"\S"   Any character that is not a space, tab, or newline.

In [3]:
text = "A23B"
# aradaki 2 basamaklı sayıyı çekip al.

#### .search()

In [4]:
num = re.search("\d\d", text)   # yan yana iki digit olduğu yeri al.
print(num)
# dikkat! çıkan sonuç bir object

<re.Match object; span=(1, 3), match='23'>

In [5]:
num = re.search("\d\d", text) 
print(num.group())  
# objenin içindeki grupları getirir. örneğimizde bir grup olduğu için sadece 23ü getirdi.

23

In [6]:
text2 = "A234B"
num = re.search("\d\d\d", text2)   # yan yana 3 digit olduğu yeri al.
print(num.group())

234

In [7]:
text3 = "A234B"
num = re.search("\d\d", text3)   # yan yana 3 digit olduğu yeri al.
print(num.group())
# ilk bulduğu 2 digiti getirdi.

23

In [8]:
text4 = "A2345B"
num = re.search("\d\d", text4)   # yan yana 3 digit olduğu yeri al.
print(num.group())
# ilk bulduğu 2 digiti getirdi.

23

#### .findall()

In [9]:
text5 = "A2345B"
num1 = re.findall("\d{2}", text5)
num1

['23', '45']

In [10]:
text5 = "4PM"  # bu sefer integer olmaya değeri getirsin.

In [11]:
nondeci = re.search("\D", text5)
print(nondeci.group())

P

In [12]:
# telefon numarasını çekip alalım
text = "My phone number is 5055523545"

In [13]:
output = re.search("\d\d\d\d\d\d\d\d\d\d", text)
print(output.group())

5055523545

In [14]:
# numarayı gruplara bölersek... (rakamlar içindeki gruplar (mesela alan kodu) ayrı bir anlam ifade edebilir)
output = re.search("(\d\d\d)(\d\d\d)(\d\d\d\d)", text)
print(output.group(1))

505

In [15]:
output = re.search("(\d\d\d)(\d\d\d)(\d\d\d\d)", text)
print(output.group(3))
# rakamaların 3.grubunu çektik.

3545

In [16]:
# rakamları çekip alalım
value = "9 1, t 10, o 100. 100000"

#### .findall()

In [17]:
# findall() fonksiyonu ile yapacağız.
output = re.findall("\d{1,2}", value)  # 1 basamaklı integerleri al, 2 basamaklı olanlara kadar da al.
print(output)

['9', '1', '10', '10', '0', '10', '00', '00']

In [18]:
output = re.findall("\d{1,3}", value)  # 1 basamaklı integerleri al, 3 basamaklı olanlar kadar da al.
print(output)
# son rakamdan 3 digit alınca geriye bir 3 sıfır kaldı

['9', '1', '10', '100', '100', '000']

In [19]:
output = re.findall("\d{1,5}", value)  # 1 basamaklı integerleri al, 5 basamaklı olanlar kadar da al.
print(output)
# son rakamdan 5 digit alınca geriye bir 0 kaldı

['9', '1', '10', '100', '10000', '0']

In [20]:
output = re.findall("\d{1,6}", value)  # 1 basamaklı integerleri al, 6 basamaklı olanlar kadar da al.
print(output)

['9', '1', '10', '100', '100000']

#### .sub()

In [21]:
# istediğim değerleri remove edebilirim. - ler boşluklar, # işime yaramıyor. bunları remove edeceğim.
phone = "2004-959-559 # This is phone number"

In [22]:
output = re.sub("\D", "", phone)
print(output)
# D olanları yani numerik olmayanları remove et kalanı getir.

2004959559

In [23]:
output = re.sub("\D", ".", phone)
print(output)
# D olanları remove et ve remove ettiklerinin yerine "." koy

2004.959.559.......................

In [24]:
# şimdi bir pandas serie si üzerinde çalışalım.

In [41]:
s1 = pd.Series(["a3", "b44", "c5"])
s1

0     a3
1    b44
2     c5
dtype: object

#### .extract()

In [42]:
s1.str.extract("(\d)")

   0
0  3
1  4
2  5

In [43]:
s1.str.extract("(\d\d)")
# str kullanarak tüm pandas serie si üzerinde gezinebiliyorum. 
# extract:

     0
0  NaN
1   44
2  NaN

In [44]:
s2 = pd.Series(["a3", "b44", "c5"])
s2

0     a3
1    b44
2     c5
dtype: object

In [45]:
s2.str.extract("(\d\d)")

     0
0  NaN
1   44
2  NaN

In [46]:
s3 = pd.Series(["a3", "b44", "c556777"])
s3.str.extract("(\d{1,10})")

        0
0       3
1      44
2  556777

In [49]:
# bu sefer serie deki harfleri istiyorum:
s4 = pd.Series(["a3aa", "b4aa", "c5aa"])

In [50]:
# w : any letter 
s4.str.extract("(\w)\d(\w)(\w)")
# arada bir rakam olduğunu bilmeden bu ifadeyi yazamazsın. bir patern yakalaman lazım.

   0  1  2
0  a  a  a
1  b  a  a
2  c  a  a

In [51]:
s4.str.extract("(\w)(\d)(\w)(\w)")

   0  1  2  3
0  a  3  a  a
1  b  4  a  a
2  c  5  a  a

In [32]:
s4.str.extract("(\w)\d(\w\w)")
# önce bir letter al (grup1), sonra arada bir digit var onu at, sonra ikinci grup olarak iki letter yan yana olarak al.

   0   1
0  a  aa
1  b  aa
2  c  aa

In [33]:
# süslü parantezde de yanyana iki letter'ı ifade edebiliriz.
s4.str.extract("(\w)\d(\w{1,2})")

   0   1
0  a  aa
1  b  aa
2  c  aa

In [34]:
# şimdi can alıcı bir örnek yapacağız.

In [35]:
# sayıları al
s= pd.Series(['40 l/100 km (comb)', 
        '38 l/100 km (comb)', '6.4 l/100 km (comb)',
       '8.3 kg/100 km (comb)', '5.1 kg/100 km (comb)',
       '5.4 l/100 km (comb)', '6.7 l/100 km (comb)',
       '6.2 l/100 km (comb)', '7.3 l/100 km (comb)',
       '6.3 l/100 km (comb)', '5.7 l/100 km (comb)',
       '6.1 l/100 km (comb)', '6.8 l/100 km (comb)',
       '7.5 l/100 km (comb)', '7.4 l/100 km (comb)',
       '3.6 kg/100 km (comb)', '0 l/100 km (comb)', 
       '7.8 l/100 km (comb)'])

s

0       40 l/100 km (comb)
1       38 l/100 km (comb)
2      6.4 l/100 km (comb)
3     8.3 kg/100 km (comb)
4     5.1 kg/100 km (comb)
5      5.4 l/100 km (comb)
6      6.7 l/100 km (comb)
7      6.2 l/100 km (comb)
8      7.3 l/100 km (comb)
9      6.3 l/100 km (comb)
10     5.7 l/100 km (comb)
11     6.1 l/100 km (comb)
12     6.8 l/100 km (comb)
13     7.5 l/100 km (comb)
14     7.4 l/100 km (comb)
15    3.6 kg/100 km (comb)
16       0 l/100 km (comb)
17     7.8 l/100 km (comb)
dtype: object

In [54]:
result = s.str.extract("(\d\d|\d.\d|\d)")
result.head(3)
# 1.grup: iki basamaklı veya digit.digit i al (float digitler için bunu koyduk) 
# veya sadece bir basamaklı digiti al (bir tane 0 için bunu koyduk)

     0
0   40
1   38
2  6.4

In [63]:
result = s.str.extract("(\d\d|\d.\d|\d).+(\d\d\d)")
result
# 2.grup için  .+ koyup devam ediyoruz. bu sayede örneğin 5.7 l/100 km (comb) daki 100'ü de çekebiliriz

      0    1
0    40  100
1    38  100
2   6.4  100
3   8.3  100
4   5.1  100
5   5.4  100
6   6.7  100
7   6.2  100
8   7.3  100
9   6.3  100
10  5.7  100
11  6.1  100
12  6.8  100
13  7.5  100
14  7.4  100
15  3.6  100
16    0  100
17  7.8  100